{
    "scriptures": [
        {
            "verse": "For this is the whole duty of man, that we fear Yah and keep his commandments and his commandments are not grievous.",
            "action": "Read Exodus 20 and find at least two commandments you can do better with",
            "scripture": "Ecclesiastes 12:13"
        },
        {
            "verse": "Sin is the transgression of the law",
            "action": "Read a scripture from the book of Deuteronomy and try to find a law you are not currently aware of.",
            "scripture": "1 John 3:4"
        },
        {
            "verse": "For this is the love of Yah, that we keep his commandments",
            "action": "How can we show Yah that we love him more today?",
            "scripture": "1 John 5:3"
        },
        {
            "verse": "We shall not live by bread alone, but by every word that proceeds from Yah",
            "scripture": "Luke 4:4",
            "action": "Go back into the Torah (Genesis-Deuteronomy) and find some of Yah's words that you may not be familiar with."
        },
        {
            "verse": "Humble yourselves therefore under the mighty hand of Elohim, that he may exalt you in due time:",
            "scripture": "1 Peter 5:6",
            "action": "How can you show more humility today?"
        },
        {
            "verse": "Have not I commanded thee? Be strong and of a good courage; be not afraid, neither be thou dismayed: for the Yah your Elohim is with thee whithersoever thou goest.",
            "scripture": "Joshua 1:9",
            "action": "When was the last time you didnt show courage? How can you change that next time?"
        },
        {
            "verse": "Blessed are they that keep his testimonies, and that seek him with the whole heart.",
            "scripture": "Psalms 119:2",
            "action": "How can you seek Yah more today?"
        },
        {
            "verse": " I remembered thy judgments of old, O Yah; and have comforted myself.",
            "scripture": "Psalms 119:52",
            "action": "What is one of Yah's wonders that you can think about to comfort yourself?"
        },
        {
            "verse": "I thought on my ways, and turned my feet unto thy testimonies.",
            "scripture": "Psalms 119:59",
            "action": "What is one way you can turn your feet back to the testimonies of Yah?"
        },
        {
            "verse": "I made haste, and delayed not to keep thy commandments.",
            "scripture": "Psalms 119:60",
            "action": "Have you been delaying to keep Yah's commandments? Why or why not?"
        },
        {
            "verse": "The law of thy mouth is better unto me than thousands of gold and silver.",
            "scripture": "Psalms 119:72",
            "action": "Which one is more important to you: The Torah (Law) of Yah or money?"
        },
        {
            "verse": "Depart from me, ye evildoers: for I will keep the commandments of my God.",
            "scripture": "Psalms 119:115",
            "action": "Who is someone around you that you need to depart from you in order for you to grow?"
        },
        {
            "verse": "My flesh trembleth for fear of thee; and I am afraid of thy judgments.",
            "scripture": "Psalms 119:120",
            "action": "Are you afraid of Yah's righteous judgements according to the Torah?"
        },
        {
            "verse": "I thought on my ways, and turned my feet unto thy testimonies.",
            "scripture": "Psalms 119:59",
            "action": "What is one way you can turn your feet back to the testimony of Yah?"
        },
        {
            "verse": "I hate and abhor lying: but thy law do I love.",
            "scripture": "Psalms 119:163",
            "action": "When was the last time you lied? Why?"
        },
        {
            "verse": "For whosoever shall keep the whole law, and yet offend in one point, he is guilty of all.",
            "scripture": "James 2:10",
            "action": "Find a law you are not keeping a make an action plan to keep it today."
        },
        {
            "verse": "Can the fig tree, my brethren, bear olive berries? either a vine, figs? so can no fountain both yield salt water and fresh",
            "scripture": "James 3:12",
            "action": "Read this scripture carefully. How is this being exemplified in your life?"
        },
        {
            "verse": "This wisdom descendeth not from above, but is earthly, sensual, devilish.",
            "scripture": "James 3:15",
            "action": "Is some of the wisdom you are holding onto earthly? What is the heavenly alternative?"
        },
        {
            "verse": "For where envying and strife is, there is confusion and every evil work.",
            "scripture": "James 3:16",
            "action": "How can you eliminate envying and strife in your life?"
        },
        {
            "verse": "Submit yourselves therefore to Elohim. Resist the devil, and he will flee from you.",
            "scripture": "James 4:7",
            "action": "How can you resist the devil today to cause him to flee from you?"
        },
        {
            "verse": "Humble yourselves in the sight of Yahuah, and he shall lift you up.",
            "scripture": "James 4:10",
            "action": "verse 2 ways you can minimize your pride and humble yourself before Yah?"
        },
        {
            "verse": "I thought on my ways, and turned my feet unto thy testimonies.",
            "scripture": "Psalms 119:59",
            "action": "What is one way you can turn your feet back to the testimonies of Yah?"
        },
        {
            "verse": "Therefore to him that knoweth to do good, and doeth it not, to him it is sin.",
            "scripture": "James 4:17",
            "action": "Familiarize yourself with Leviticus and Deuteronomy to become more aware of Yah's laws."
        },
        {
            "verse": "Then Yahushua said unto them, 'Yet a little while is the light with you. Walk while ye have the light, lest, darkness come upon you; for he that walks in darkness knows not where he goes'",
            "scripture": "John 12:35",
            "action": "We know that the commandments are a lamp, and the Torah (Law) is the light. Let's let those guide us in darkness."
        },
        {
            "verse": "For Yahuah your Elohim is he that goes with you, to fight for you against your enemies, to save you.",
            "scripture": "Deuteronomy 20:4",
            "action": "Remember that Yah is with you, if you keep his commandments. Trust that he will fight your battles for you."
        },
        {
            "action": "test action",
            "verse": "updated test verse",
            "scripture": "test scripture"
        }
    ]
}